[
    {
        "id": 1,
        "title": "Что такое HTML?",
        "content": "HTML (HyperText Markup Language) — это язык разметки, используемый для создания веб-страниц. Он является основой веб-разработки и позволяет структурировать содержимое страницы. HTML состоит из элементов, которые обозначаются тегами. Например, тег <h1> используется для заголовков первого уровня, а тег <p> — для абзацев текста. HTML также поддерживает добавление мультимедиа, таких как изображения, видео и аудио. С появлением HTML5 были добавлены новые семантические теги, такие как <header>, <footer>, <article> и <section>, которые помогают лучше структурировать документ. HTML работает в связке с CSS и JavaScript, что позволяет создавать интерактивные и стилизованные веб-страницы.",
        "tags": ["html", "веб-разработка", "основы"],
        "category": "Веб-технологии"
    },
    {
        "id": 2,
        "title": "Основы CSS",
        "content": "CSS (Cascading Style Sheets) — это язык стилей, используемый для описания внешнего вида документа, написанного на HTML. CSS позволяет задавать цвета, шрифты, отступы, размеры и другие параметры визуального оформления. Основные концепции CSS включают селекторы, свойства и значения. Селекторы определяют, к каким элементам HTML применяются стили, а свойства и значения задают конкретные параметры оформления. Например, селектор `h1 { color: blue; }` задает синий цвет для всех заголовков первого уровня. CSS также поддерживает медиа-запросы, которые позволяют адаптировать стили под разные устройства и размеры экранов. С появлением CSS3 были добавлены новые возможности, такие как анимации, градиенты и тени, что значительно расширило возможности веб-дизайна.",
        "tags": ["css", "веб-разработка", "стили"],
        "category": "Веб-технологии"
    },
    {
        "id": 3,
        "title": "Введение в JavaScript",
        "content": "JavaScript — это язык программирования, который позволяет добавлять интерактивность на веб-страницы. Он используется для создания динамических элементов, таких как слайдеры, модальные окна, формы обратной связи и многое другое. JavaScript работает на стороне клиента (в браузере) и может взаимодействовать с HTML и CSS. Основные концепции JavaScript включают переменные, функции, объекты и события. Например, с помощью JavaScript можно отслеживать клики пользователя и изменять содержимое страницы в реальном времени. Современный JavaScript (ES6+) поддерживает такие функции, как стрелочные функции, деструктуризация, промисы и async/await, что делает код более читаемым и эффективным. JavaScript также используется на стороне сервера с помощью платформы Node.js, что позволяет создавать полноценные веб-приложения.",
        "tags": ["javascript", "веб-разработка", "программирование"],
        "category": "Программирование"
    },
    {
        "id": 4,
        "title": "Что такое Git?",
        "content": "Git — это система контроля версий, которая помогает отслеживать изменения в коде и работать в команде. Git позволяет создавать репозитории, в которых хранится история всех изменений проекта. Основные команды Git включают `git init` (инициализация репозитория), `git add` (добавление файлов в индекс), `git commit` (фиксация изменений) и `git push` (отправка изменений на удаленный сервер). Git также поддерживает ветвление, что позволяет работать над разными версиями проекта одновременно. Например, можно создать ветку для разработки новой функции, а затем объединить ее с основной веткой с помощью команды `git merge`. Git интегрируется с такими платформами, как GitHub, GitLab и Bitbucket, что упрощает совместную работу над проектами.",
        "tags": ["git", "версионный контроль", "инструменты"],
        "category": "Инструменты"
    }
]
