[
    {
        "id": 1,
        "title": "Что такое HTML?",
        "content": "HTML (HyperText Markup Language) — это язык разметки, используемый для создания веб-страниц. Он является основой веб-разработки и позволяет структурировать содержимое страницы. HTML состоит из элементов, которые обозначаются тегами. Например, тег &lt;h1&gt; используется для заголовков первого уровня, а тег &lt;p&gt; — для абзацев текста. HTML также поддерживает добавление мультимедиа, таких как изображения, видео и аудио. С появлением HTML5 были добавлены новые семантические теги, такие как &lt;header&gt;, &lt;footer&gt;, &lt;article&gt; и &lt;section&gt;, которые помогают лучше структурировать документ. HTML работает в связке с CSS и JavaScript, что позволяет создавать интерактивные и стилизованные веб-страницы.",
        "tags": ["html", "веб-разработка", "основы"],
        "category": "Веб-технологии"
    },
    {
        "id": 2,
        "title": "Основы CSS",
        "content": "CSS (Cascading Style Sheets) — это язык стилей, используемый для описания внешнего вида документа, написанного на HTML. CSS позволяет задавать цвета, шрифты, отступы, размеры и другие параметры визуального оформления. Основные концепции CSS включают селекторы, свойства и значения. Селекторы определяют, к каким элементам HTML применяются стили, а свойства и значения задают конкретные параметры оформления. Например, селектор `h1 { color: blue; }` задает синий цвет для всех заголовков первого уровня. CSS также поддерживает медиа-запросы, которые позволяют адаптировать стили под разные устройства и размеры экранов. С появлением CSS3 были добавлены новые возможности, такие как анимации, градиенты и тени, что значительно расширило возможности веб-дизайна.",
        "tags": ["css", "веб-разработка", "стили"],
        "category": "Веб-технологии"
    },
    {
        "id": 3,
        "title": "Введение в JavaScript",
        "content": "JavaScript — это язык программирования, который позволяет добавлять интерактивность на веб-страницы. Он используется для создания динамических элементов, таких как слайдеры, модальные окна, формы обратной связи и многое другое. JavaScript работает на стороне клиента (в браузере) и может взаимодействовать с HTML и CSS. Основные концепции JavaScript включают переменные, функции, объекты и события. Например, с помощью JavaScript можно отслеживать клики пользователя и изменять содержимое страницы в реальном времени. Современный JavaScript (ES6+) поддерживает такие функции, как стрелочные функции, деструктуризация, промисы и async/await, что делает код более читаемым и эффективным. JavaScript также используется на стороне сервера с помощью платформы Node.js, что позволяет создавать полноценные веб-приложения.",
        "tags": ["javascript", "веб-разработка", "программирование"],
        "category": "Программирование"
    },
    {
        "id": 4,
        "title": "Что такое Git?",
        "content": "Git — это система контроля версий, которая помогает отслеживать изменения в коде и работать в команде. Git позволяет создавать репозитории, в которых хранится история всех изменений проекта. Основные команды Git включают `git init` (инициализация репозитория), `git add` (добавление файлов в индекс), `git commit` (фиксация изменений) и `git push` (отправка изменений на удаленный сервер). Git также поддерживает ветвление, что позволяет работать над разными версиями проекта одновременно. Например, можно создать ветку для разработки новой функции, а затем объединить ее с основной веткой с помощью команды `git merge`. Git интегрируется с такими платформами, как GitHub, GitLab и Bitbucket, что упрощает совместную работу над проектами.",
        "tags": ["git", "версионный контроль", "инструменты"],
        "category": "Инструменты"
    },
    {
        "id": 5,
        "title": "Основы Python",
        "content": "Python — это высокоуровневый язык программирования, который широко используется для разработки веб-приложений, анализа данных, искусственного интеллекта и автоматизации задач. Python отличается простым и понятным синтаксисом, что делает его идеальным выбором для начинающих программистов. Основные концепции Python включают переменные, типы данных, функции, классы и модули. Python также поддерживает множество библиотек и фреймворков, таких как Django для веб-разработки, Pandas для анализа данных и TensorFlow для машинного обучения.",
        "tags": ["python", "программирование", "основы"],
        "category": "Программирование"
    },
    {
        "id": 6,
        "title": "Что такое Docker?",
        "content": "Docker — это платформа для разработки, доставки и запуска приложений в контейнерах. Контейнеры позволяют изолировать приложения и их зависимости, что упрощает развертывание и масштабирование. Docker использует технологию контейнеризации, которая позволяет упаковать приложение со всеми его зависимостями в единый образ. Этот образ можно запускать на любой системе, где установлен Docker. Docker широко используется в DevOps для автоматизации процессов разработки и развертывания.",
        "tags": ["docker", "контейнеризация", "devops"],
        "category": "Инструменты"
    },
    {
        "id": 7,
        "title": "Основы SQL",
        "content": "SQL (Structured Query Language) — это язык программирования, используемый для работы с реляционными базами данных. SQL позволяет создавать, изменять и извлекать данные из баз данных. Основные команды SQL включают `SELECT` (выборка данных), `INSERT` (вставка данных), `UPDATE` (обновление данных) и `DELETE` (удаление данных). SQL также поддерживает создание таблиц, индексов и представлений. SQL широко используется в веб-разработке, анализе данных и управлении базами данных.",
        "tags": ["sql", "базы данных", "основы"],
        "category": "Базы данных"
    },
    {
        "id": 8,
        "title": "Что такое Kubernetes?",
        "content": "Kubernetes — это система для автоматизации развертывания, масштабирования и управления контейнеризированными приложениями. Kubernetes позволяет управлять кластерами контейнеров, обеспечивая их отказоустойчивость и масштабируемость. Kubernetes поддерживает множество функций, таких как автоматическое масштабирование, балансировка нагрузки и управление конфигурациями. Kubernetes широко используется в DevOps для управления контейнерами в производственных средах.",
        "tags": ["kubernetes", "контейнеризация", "devops"],
        "category": "Инструменты"
    },
    {
        "id": 9,
        "title": "Основы React",
        "content": "React — это библиотека JavaScript для создания пользовательских интерфейсов. React позволяет создавать компоненты, которые можно повторно использовать в разных частях приложения. React использует виртуальный DOM для оптимизации производительности и обновления интерфейса. React также поддерживает односторонний поток данных, что упрощает управление состоянием приложения. React широко используется для разработки современных веб-приложений.",
        "tags": ["react", "веб-разработка", "javascript"],
        "category": "Веб-технологии"
    },
    {
        "id": 10,
        "title": "Что такое REST API?",
        "content": "REST (Representational State Transfer) — это архитектурный стиль для создания веб-сервисов. REST API позволяет взаимодействовать с сервером через HTTP-запросы, такие как GET, POST, PUT и DELETE. REST API использует JSON или XML для передачи данных. REST API широко используется для создания веб-приложений и интеграции с внешними сервисами.",
        "tags": ["rest", "api", "веб-разработка"],
        "category": "Веб-технологии"
    }
]
